app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = 'George Lucas'
---
  def similar
    id = params[:id]
    @movie = Movie.find(id)

    if @movie
      if@movie.director == nil or @movie.director == ""
        session[:noDirector] = @movie.title
        redirect_to movies_path and return
      else
        @SameDirectorMovies = Movie.find_all_by_director(@movie.director)